import matplotlib.pyplot as plt
import pandas as pd


data = {
    "Name": ["Власова Каріна Вікторівна", "Власова Марина Вікторівна", "Войдюк Ігор Володимирович", 
             "Волощук Ростислав Русланович", "Давиденко Вікторія Олександрівна", "Давиденко Катерина Олександрівна", 
             "Деморацький Назар Євгенійович", "Денисенко Владислав Віталійович", "Євлахович Ігор Віталійович", 
             "Зінін Максим Юрійович", "Ібе Джанет Юнанівна", "Карчевський Володимир Денисович", 
             "Литвин Анастасія Дмитрівна", "Лужанський Ростислав Павлович", "Мітькін Дмитро Анатолійович", 
             "Мозговий Максим Володимирович", "Моргун Ігор Вячеславович", "Мошняга Антон Віталійович", 
             "Орлов Андрій Андрійович", "Паладій Даниїл Едуардович", "Покотило Марія Михайлівна", 
             "Прокопенко Роман Олександрович", "Руденко Євгеній Васильович", "Сайфулліна Софія Айратівна"],
    "Marks": [0, 2, 3, 0, 0, 0, 2, 0, 0, 0, 2, 5, 2, 1, 1, 4, 2, 1, 2, 0, 0, 0, 1, 2]
}


df = pd.DataFrame(data)


df = df.sort_values(by="Marks", ascending=False)


plt.figure(figsize=(10, 8))
plt.barh(df["Name"], df["Marks"], color='skyblue')
plt.xlabel('Marks')
plt.ylabel('Name')
plt.title('Student Marks Visualization')
plt.gca().invert_yaxis()  
plt.show()
